In [3]:
import numpy as np
import pandas as pd

In [ ]:
# create a simple dataframe

data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', 'blue', 'yellow', 'blue', 'black', 'green', 'red']
})

# view the data
data

In [ ]:
data[1:3, 2]

## loc and iloc

- loc gets rows (or columns) with particular labels from the index.
- iloc gets rows (or columns) at particular positions in the index (**so it only takes integers**).

### Find all the rows based on any condition in a column

We can solve types of queries with a simple line of code using pandas.DataFrame.loc[]. We just need to pass the condition within the loc statement.

In [ ]:
data

In [ ]:
data.loc[data.age >= 15]

### Find all the rows with more than one condition in columns

In [ ]:
data

In [ ]:
data.loc[(data.age >= 12) & (data.gender == "M")]

### Select only required columns with a condition

In [ ]:
data.loc[(data.age >= 12),["age", "favourite_color", "city"]]

### Update the values of a particular column on selected rows

We can do this by running a for loop as well but if our dataset is big in size, then it would take forever to complete the task. Using loc in Pandas, we can do this within seconds, even on bigger datasets!

We just need to specify the condition followed by the target column and then assign the value with which we want to update

In [ ]:
data

In [ ]:
# display(data.loc[data.age >= 12])
display(data.loc[data.age >= 12,['age', "section"]])
data.loc[data.age >= 12,["section"]] = "UpdateS"
display(data.loc[data.age >= 12,['age', "section"]])

In [ ]:
display(data.loc[data.age >= 20 , ['favourite_color', 'city']])
data.loc[data.age >= 20 , ['favourite_color', 'city']] = ['BLACK', "Dubai"]
data

### Select rows with indices using iloc

In [ ]:
data

In [ ]:
data.iloc[1:3,2]

In [ ]:
# select rows with indexes

data.iloc[[0,2]]

# 1st the row and the 3rd row

### Select rows with particular indices and particular columns == Slicing

In [ ]:
display(data)
data.iloc[[0,2],[1,3]]

# "," is individual rows and column

# InClass Assignment

In [4]:
datasetExample = pd.read_csv('FinalOutput.csv')
datasetExample

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
0    1  Prashant  1000         12000         HR              13200.0
1    2      Amar  2000         24000        Ops              25200.0
2    3    Chitra  2000         24000      Admin              25200.0
3    3    Chitra  2000         24000      Admin              25200.0
4    4  Utkarsha  9878        118536        Ops             124462.8
5    5      Ajit  9999        119988         HR             125987.4

In [7]:
# 1. Extract the records of employees whose esal is greater than 5000
datasetExample.loc[datasetExample.esal > 5000]

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
4    4  Utkarsha  9878        118536        Ops             124462.8
5    5      Ajit  9999        119988         HR             125987.4

In [8]:
# 2. Extract only ename and department of employees whose esal is greater than 5000

datasetExample.loc[datasetExample.esal > 5000, ["ename", 'department']]

      ename department
4  Utkarsha        Ops
5      Ajit         HR

In [10]:
# 3. Extract those records whose sal is greater than 6500 and belongs to Ops dept

datasetExample.loc[(datasetExample.esal > 6500) & (datasetExample.department == "Ops")]

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
4    4  Utkarsha  9878        118536        Ops             124462.8

In [11]:
# 4. Display the name of employees whose salary is greater than 5000 and belongs to HR dept
datasetExample.loc[(datasetExample.esal > 5000) & (datasetExample.department == "HR"), ['ename']]

  ename
5  Ajit

In [14]:
# 5. Replace the salary of the employee as 7000 if the current salary is less than 1500

datasetExample.loc[(datasetExample.esal < 1500), ["esal"]] = 7000
datasetExample

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
0    1  Prashant  7000         12000         HR              13200.0
1    2      Amar  2000         24000        Ops              25200.0
2    3    Chitra  2000         24000      Admin              25200.0
3    3    Chitra  2000         24000      Admin              25200.0
4    4  Utkarsha  9878        118536        Ops             124462.8
5    5      Ajit  9999        119988         HR             125987.4

In [15]:
datasetExample

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
0    1  Prashant  7000         12000         HR              13200.0
1    2      Amar  2000         24000        Ops              25200.0
2    3    Chitra  2000         24000      Admin              25200.0
3    3    Chitra  2000         24000      Admin              25200.0
4    4  Utkarsha  9878        118536        Ops             124462.8
5    5      Ajit  9999        119988         HR             125987.4

In [16]:
datasetExample.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
dtype: bool

In [18]:
datasetExample.drop_duplicates(inplace = True, ignore_index = True)
display (datasetExample)

   eid     ename  esal  yearlySalary department  UpdatedYearlySalary
0    1  Prashant  7000         12000         HR              13200.0
1    2      Amar  2000         24000        Ops              25200.0
2    3    Chitra  2000         24000      Admin              25200.0
3    4  Utkarsha  9878        118536        Ops             124462.8
4    5      Ajit  9999        119988         HR             125987.4